Revit 2024 API
TransferringProjectStandardsEventArgs Properties
The TransferringProjectStandardsEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
Document
 The document associated with the event.
 (Inherited from RevitAPIPreDocEventArgs.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
SourceDocument
 Source document.
TargetDocument
 Target document.
See Also
TransferringProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace